{
  "analysis_id": "67fb2ceb-acd9-45f0-a93b-2af8ddabebd3",
  "success": true,
  "pdf_info": {
    "filename": "examen.pdf",
    "metadata": {
      "num_pages": 2,
      "title": "",
      "author": "",
      "creation_date": "D:20240927161845",
      "pages_info": [
        {
          "page": 1,
          "char_count": 600,
          "has_images": true
        },
        {
          "page": 2,
          "char_count": 1815,
          "has_images": true
        }
      ]
    }
  },
  "classification": {
    "success": true,
    "tipo_examen": "examen médico",
    "categoria": "general",
    "especialidad": "medicina general",
    "confianza": 0.5,
    "timestamp": "2025-06-30T19:26:51.126625"
  },
  "medical_analysis": {
    "success": true,
    "analysis": "Valores analizados:\n\n* Hemoglobina (Hb): 14.1 g/dl\n* Hematocrito (Hct): 44.4%\n* Nivel de leucocitos (L): 8.37 x 10³/mm³\n* Nivel de linfocitos (LN): 23.40%\n* Nivel de monocitos (M): 0.24 x 10³/ul\n* Nivel de basófilos (B): 0.03 x 10³/ul\n* Nivel de eosinofilos (EO): 0.24 x 10³/ul\n* Nivel de neutrófilos (Ne): 5.75 x 10³/mm³\n* RDW-CV: 13.0 x 10*3/mm\n\nInterpretación clínica:\nEstos valores sugieren una anemia mild, con un nivel de hemoglobina dentro del rango normal. El hematocrito es ligeramente bajo, lo que puede indicar una disminución en la cantidad de células sanguíneas. La cantidad de leucocitos es normal, pero hay un aumento en los linfocitos y monocitos, lo que puede indicar una inflamación o infecciones. El nivel de basófilos es bajo, lo que puede indicar una deficiencia en la producción de este tipo de glóbulos rojos. El nivel de eosinofilos es normal, pero hay un aumento en los neutrófilos, lo que puede indicar una inflamación o infecciones. La RDW-CV es ligeramente alta, lo que puede indicar una heterogeneidad en la población de glóbulos rojos.\nRecomendaciones:\nSe recomienda realizar un seguimiento de los valores de hemoglobina y hematocrito para evaluar la evolución de la anemia. Se debe buscar la causa de la inflamación o infecciones que están presentes en el paciente, ya que pueden estar relacionadas con la alteración en el nivel de leucocitos y monocitos. Es importante realizar pruebas de bacterias y virus para determinar si existe una infección subyacente. Si los valores de neutrófilos continúan aumentando, se debe considerar la posibilidad de una enfermedad inflamatoria crónica.\nNivel de urgencia:\nEl examen no muestra valores críticos que requieran atención inmediata. Sin embargo, es importante seguir evaluando los valores de hemoglobina y hematocrito para determinar si hay una evolución hacia un estado de anemia más grave. Si los síntomas persistentes o aumento en los valores de leucocitos y monocitos, se debe considerar la posibilidad de una enfermedad inflamatoria crónica o una infección subyacente.\nConclusión:\nEl examen de sangre muestra un nivel de anemia mild, con un aumento en los linfocitos y monocitos. Es importante realizar pruebas de bacterias y virus para determinar si existe una infección subyacente y seguir evaluando los valores de hemoglobina y hematocrito para determinar si hay una evolución hacia un estado de anemia más grave.",
    "urgency_level": "CRÍTICO",
    "exam_type": "examen médico",
    "timestamp": "2025-06-30T19:32:35.432690",
    "session_id": "test_001"
  },
  "patient_explanation": "Buen este momento, queremos compartir los resultados de los exámenes de sangre que hemos realizado. Los valores son: Hemoglobina (Hb): 14.1 g/dl, Hematocrito (Hct): 44.4%, Nivel de leucocitos (L): 8.37 x 10³/mm³, Nivel de linfocitos (LN): 23.40%, Nivel de monocitos (M): 0.24 x 10³/ul, Nivel de basófilos (B): 0.03 x 10³/ul, Nivel de eosinofilos (EO): 0.24 x 10³/ul, Nivel de neutrófilos (Ne): 5.75 x 10³/mm³, RDW-CV: 13.0 x 10*3/mm.\nEstos valores sugieren una anemia mild, con un nivel de hemoglobina dentro del rango normal. Sin embargo, el hematocrito es ligeramente bajo, lo que puede indicar una disminución en la cantidad de células sanguíneas. Además, hay un aumento en los linfocitos y monocitos, lo que puede indicar una inflamación o infecciones. Es importante buscar la causa de esta alteración para tratarla adecuadamente.\nSi los síntomas persistentes o aumento en los valores de leucocitos y monocitos, se debe considerar la posibilidad de una enfermedad inflamatoria crónica o una infección subyacente. Es importante realizar pruebas de bacterias y virus para determinar si existe una infección subyacente.\nEn resumen, los resultados indican una anemia mild, con un aumento en los linfocitos y monocitos. Es importante seguir evaluando los valores de hemoglobina y hematocrito para determinar si hay una evolución hacia un estado de anemia más grave. Si los síntomas persistentes o aumento en los valores de leucocitos y monocitos, se debe considerar la posibilidad de una enfermedad inflamatoria crónica o una infección subyacente.\n¿Qué significa esto para ti? Estos resultados indican que tu cuerpo está produciendo menos glóbulos rojos que necesita para mantener tu sangre saludable. Además, hay un aumento en los linfocitos y monocitos, lo que puede indicar una inflamación o infecciones. Es importante buscar la causa de esta alteración para tratarla adecuadamente.\n¿Qué debes hacer? Es importante seguir evaluando los valores de hemoglobina y hematocrito para determinar si hay una evolución hacia un estado de anemia más grave. Si los síntomas persistentes o aumento en los valores de leucocitos y monocitos, se debe considerar la posibilidad de una enfermedad inflamatoria crónica o una infección subyacente. Es importante realizar pruebas de bacterias y virus para determinar si existe una infección subyacente.\n¿Es necesario consultar con un médico inmediatamente? No, no es necesario consultar inmediatamente. Sin embargo, es importante seguir evaluando los valores de hemoglobina y hematocrito para determinar si hay una evolución hacia un estado de anemia más grave. Si los síntomas persistentes o aumento en los valores de leucocitos y monocitos, se debe considerar la posibilidad de una enfermedad inflamatoria crónica o una infección subyacente.\n¿Hay cambios en el estilo de vida que podrían ayudar? Sí, hay cambios en el estilo de vida que podrían ayudar. Por ejemplo, puedes aumentar la ingesta de hierro en tu dieta para ayudar a producir más glóbulos rojos. Además, es importante mantener una buena higiene personal y evitar enfermedades infecciosas.\n¿Es importante seguir el tratamiento? Sí, es importante seguir el tratamiento. Si se requiere un tratamiento adicional, es importante seguir las instrucciones del médico para asegurarse de que la anemia se trate adecuadamente.\nEn res",
  "processing_time": "2025-06-30T19:38:14.306269",
  "session_id": "test_001"
}