{
  "analysis_id": "1130328a-1af9-4709-ade2-7043a634236a",
  "success": true,
  "pdf_info": {
    "filename": "examen.pdf",
    "metadata": {
      "num_pages": 2,
      "title": "",
      "author": "",
      "creation_date": "D:20240927161845",
      "pages_info": [
        {
          "page": 1,
          "char_count": 600,
          "has_images": true
        },
        {
          "page": 2,
          "char_count": 1815,
          "has_images": true
        }
      ]
    }
  },
  "classification": {
    "success": true,
    "tipo_examen": "examen médico",
    "categoria": "general",
    "especialidad": "medicina general",
    "confianza": 0.5,
    "timestamp": "2025-06-30T19:16:24.552729"
  },
  "medical_analysis": {
    "success": true,
    "analysis": "El paciente, un hombre de 45 años, presentó una consulta médica para evaluar sus síntomas de hipertensión. Durante la examinación, se tomaron muestras de sangre que se analizaron en el laboratorio clínico. Los resultados obtenidos son los siguientes:\nValores análisis:\n* Microscopia directa para hongos Koh: No se observan estructuras micóticas en la muestra analizada.\n* Hemograma: El conteo de leucocitos es de 7.99 x 10^3/ul, con una proporción de neutrófilos del 57.5%. La cantidad de basófilos es del 0.40%, monocitos del 0.24% y eosinofilos del 0.20%. La médula ósea es normale.\n* Electrolytas: El nivel de potasio es de 3.5 mmol/l, el de sodio es de 136 mmol/l y el de cloro es de 98 mmol/l.\n* Glucemia: La glucosa en sangre es de 7.0 mmol/l.\nInterpretación clínica: Los resultados sugieren que el paciente tiene una leucocitosis normale, con una proporción elevada de neutrófilos. Además, hay un aumento en la cantidad de basófilos y monocitos, lo que puede indicar una inflamación. La glucosa en sangre es normal, pero el nivel de potasio es ligeramente bajo.\nNivel de urgencia: No hay valores críticos que requieran atención inmediata. Sin embargo, se recomienda seguir monitoreando los niveles de leucocitos y electrolitos para detectar cualquier cambio en la condición del paciente.\nRecomendaciones: Se recomienda continuar con el tratamiento de hipertensión y monitorear los niveles de glucosa en sangre y electrolitos. Además, se debe evaluar la presencia de enfermedades inflamatorias o infecciones que puedan estar causando la leucocitosis.\n\nEs importante mencionar que este análisis es solo una parte del examen médico completo que se realizó en el paciente y que se necesitan más resultados para llegar a una conclusión definitiva sobre su estado de salud.",
    "urgency_level": "CRÍTICO",
    "exam_type": "examen médico",
    "timestamp": "2025-06-30T19:20:07.892819",
    "session_id": "test_001"
  },
  "patient_explanation": "Buenos días, ¿cómo estás? Hoy vamos a hablar sobre los resultados de los exámenes que hicimos en el laboratorio. Los resultados son una mezcla de números y valores que nos ayudan a entender mejor tu estado de salud.\nEn cuanto a los hallazgos, hay algunos puntos importantes que quiero compartir contigo. En términos generales, los resultados son normales, pero hay algunas cosas que requieren atención.\nPor ejemplo, la cantidad de neutrófilos en tu sangre es un poco más alta de lo normal. Esto puede indicar una inflamación en el cuerpo, lo que puede ser causado por diferentes factores, como una infección o una enfermedad inflamatoria. También hay un pequeño aumento en la cantidad de basófilos y monocitos, lo que puede ser una señal de que tu sistema inmunológico está luchando contra algo.\nAdemás, la glucosa en sangre es normal, pero el nivel de potasio es un poco bajo. Esto no es grave, pero debemos seguir monitorizando para asegurarnos de que todo esté bien.\nEn cuanto a lo que debes hacer, es importante seguir con el tratamiento de hipertensión y monitorear los niveles de glucosa en sangre y electrolitos. También debemos evaluar la presencia de enfermedades inflamatorias o infecciones que puedan estar causando la leucocitosis.\nEn resumen, los resultados son normales pero hay algunas cosas que requieren atención. Es importante seguir con el tratamiento y monitorear para asegurarnos de que todo esté bien. Si tienes alguna pregunta o inquietud, no dudes en hacérmelo saber.\n¿Te sientes mejor informado?",
  "processing_time": "2025-06-30T19:22:11.330541",
  "session_id": "test_001"
}